package com.example.Restoran.taskList;
/*
1. Создать сайт (Frontend)
    1.1 Создать главную страницу
        1.1.1 Корзина
        1.1.2 Личный кабинет
        1.1.3 Поиск
        1.1.4 Кнопку с меню
        1.1.5 Обратная связь

    1.2 Создать позиции в меню
        1.2.1 Создать название
        1.2.2 Создать описание
            1.2.2.1 Вес
            1.2.2.2 Ингридиенты
            1.2.2.3 Каллорийность
            1.2.2.4 Само описание
        1.2.3 Создать картинку

1. Функционал сайта (Backend)
    1.1 Создать возможность заказа
        1.1.1 В заведении или доставкой
    1.2 Отправка заказа на кухню
    1.3 Готовка
    1.4 Уведомления об окончании готовки для ...
        1.4.1 Для оффициантов
            1.4.1.1 Несут заказ клиенту
            1.4.1.2 Суммирование цен
            1.4.1.3 Получение и оплата
        1.5.1 Для курьера
            1.5.1.1 Уведомление о том что доставка пришла
            1.5.1.2 Суммирование цен
            1.5.1.3 Получение и оплата


2. Создать возможность заказа
3. Отправка заказа на кухню
4. Сделать так что бы повара начали готовить
5. Готовка
6. Уведомление об окончании готовки оффициантам
6.1 Передача заказа курьеру
6.2 Уведомление о том что доставка пришла
6.3 Получение и оплата
7. Несут заказ клиенту
8. Клиент получил заказ
9. Суммирование цен
10. Оплата

 */